{
  "users": [
    {
      "email": "user1@bloggingworld.com",
      "username": "User1",
      "password": "pass1",
      "id": 1
    },
    {
      "email": "user2@bloggingworld.com",
      "username": "User2",
      "password": "pass2",
      "id": 2
    },
    {
      "email": "user3@bloggingworld.com",
      "username": "User3",
      "password": "pass3",
      "id": 3
    },
    {
      "email": "user4@bloggingworld.com",
      "username": "User4",
      "password": "pass4",
      "id": 4
    },
    {
      "email": "user5@bloggingworld.com",
      "username": "User5",
      "password": "pass5",
      "id": 5
    },
    {
      "email": "user6@bloggingworld.com",
      "username": "User6",
      "password": "pass6",
      "id": 6
    }
  ],
  "posts": [
    {
      "title": "Did playing two spinners prove a costly miss for Team India?",
      "content": "India came tantalizingly close to a win in the first test against Sri Lanka as they snared seven wickets when play was called off due to bad light on the final day. Skipper Virat Kohli led from the front with a brilliant century in the second innings followed by a fiery spell of fast bowling by the Indian attack. But did India miss a trick by playing two spinners despite knowing the overcast conditions while going into the test match?\n\nIt is in this context that India’s decision to play two spinners – Ravichandran Ashwin and Ravindra Jadeja – appears quite baffling. The duo bowled a total of just 10 overs in both innings of the match. In fact Ashwin did not even get a chance to bowl in the second innings while Jadeja bowled one over apiece in both innings. It was left to the fast bowlers to do bulk of the bowling.\n\nPlaying two spinners in overcast conditions was never really going to bear fruit for India. What if India had played one extra specialist batsman or fast bowler in place of the second spinner? That would have shored up India’s batting or given more teeth to the bowling attack as well. Given the fact that the match went down to the wire, an extra pacer or batsman could have made the difference between a draw and a win for Team India.\n",
      "userId": 1,
      "category": "Sports",
      "date": 1511612628454,
      "time": 1511612628454,
      "user": "user1",
      "id": 1
    },
    {
      "title": "India’s long journey to qualify for the 2019 FIBA World Cup begins",
      "content": "Thirty-seven years ago, in the pleasant late-summer in Moscow, Indian basketball made history. A series of fortuitous circumstances—including a golden generation of Indian basketball stars and a series of international diplomatic breakdowns—made India an unlikely entrant in the Men’s basketball fray of the 1980 Summer Olympics. India were the weakest team in the tournament and lost all seven of their games. Still, it was the competitive high-point in Indian hoops, an achievement that has never been matched again.\nIndian basketball has since dipped out of contention of major world tournaments, and India has generally been one of the weaker teams in the Asian level, too. But now, the International Basketball Federation (FIBA) has introduced a new competition system that could help India gain international experience and have a chance to participate against world superpowers at the highest-level.\nIn a few days, India will begin their First Round games of the 2019 FIBA World Cup Qualifiers. India has never played in the World Cup (formerly known as the FIBA World Championship), which FIBA is now angling as a competition with equal prestige as the Olympics. The road ahead to be amongst the 32 best teams to play at the tournament in China in August/September 2019 will be difficult for the Indian Men (currently ranked 64). But India has been able to unearth a number of exciting young players in recent years with better scouting and development. For the current “golden generation”, the road to play in a prestigious world tournament begins now.",
      "userId": 1,
      "category": "Sports",
      "date": 1511612754242,
      "time": 1511612754242,
      "user": "user1",
      "id": 2
    },
    {
      "title": "Saturday Night Live: the best and worst musical hosts",
      "content": "This weekend, Chance the Rapper will take the stage to host Saturday Night Live, leaving the musical guest duties to Eminem. Last weekend, Taylor Swift rejoined the late-night sketch institution for a couple of songs, but she also handled full hosting responsibilities back in 2009. Ever since Paul Simon emceed the second-ever episode back in 1975, SNL has granted adventurous musicians the opportunity to try their hand at sketch work.\n\nEpisodes hosted by non-professional actors are always dicey; there are few experiences more exquisitely painful than watching a good-natured quarterback stumble his way through a commercial parody. Musicians generally have a better go of things, channeling their natural stage presence into a more precise format. But when they tank, they tank hard. We’ve surveyed Saturday Night Live’s long history of turning the host’s mic over to music stars.",
      "userId": 2,
      "category": "Music",
      "date": 1511612895989,
      "time": 1511612895989,
      "user": "user2",
      "id": 3
    },
    {
      "title": "The demons and obsessions of jazz genius Thelonious Monk",
      "content": "Consider this: both Dizzy Gillespie and Thelonious Monk were born in 1917. The creative DNA and brilliance of each musician were integral to the birth of modern jazz. For countless hours, weeks and months during the early 1940s they played, studied, argued and innovated together, along with Charlie Parker, drummer Kenny Clarke, bassist Oscar Pettiford, guitarist Charlie Christian and a steady progression of black men dedicated to exploring the possibilities of the music of their time, and to changing its shape. (And yes, aside from the pianist Mary Lou Williams and a number of female vocalists, this chapter in musical development is about the men.)\n\nThen, by virtue of his crowd-pleasing pyrotechnic style, “dizzy as a fox” personality and willingness to school the squares, combined with the organisational gifts necessary to keep his bands together, trumpeter Gillespie’s career soared to the stars while pianist Monk, the jobbing musician who couldn’t, more than wouldn’t, conform to the conventions of the job, spent most of his professional life struggling to support his family.\n\nYet, although his dazzle is not dimmed, in their centennial year’s London jazz festival, Dizzy is treated to only one commemorative concert, while Monk and his music dominate two full days. We love Dizzy, but Monk’s multi-dimensional mystery tugs more insistently at our consciousness than Dizzy’s sophisticated, sun-drenched delight. The ineffable allure of shadows.",
      "userId": 2,
      "category": "Music",
      "date": 1511612985814,
      "time": 1511612985814,
      "user": "user2",
      "id": 4
    },
    {
      "title": "Women voters: Gujarat poll will test their NaMo love vs DeMo scars",
      "content": "At one level the Pew research center’s Spring 2017 Global Attitudes Survey shows that Prime Minister Narendra Modi has similar favorability among men (89%) and women (86%). But on specific aspects of his performance, it also shows a significance divergence by gender. For example, on his handling of communal relations Modi’s approval rating among women is lower than among men by a 13 percentage points difference. For terrorism there is a 11 percentage points difference, for rising prices 10, and so on.  Evidently on a host of issues women judge him less rose-tintedly.\n\nWhat’s behind the masks and shades? (File photo by Sanjay Sekhri)\n\nTurning specifically to Gujarat, in the 2012 assembly election which recorded a historic turnout overall, not only did the number of women voters who cast their vote jump to 69.52% from 57.02% in 2007,  they really broke for BJP in large numbers. Today, even if their dissatisfaction has not grown enough for them to vote for Congress but enough for them to stay at home, that would be a cause for worry for the ruling party. Consider that in 36 seats the vote margin was less than 5000 in 2012 or that in rural Gujarat the vote share of the two parties runs neck and neck.\nPartly the coming poll will be a test of how much demonetization scarred the women of Gujarat. Of course it took a toll on women all across India, those who were outside the banking system, who had to eke out scarce time to queue up at ATMs even unsafely into the night, whose secret caches of household savings were abruptly brought to light, sometimes only to be lost to male relatives handling the exchange of old notes. Cash as a personal safety net was just ripped away. Now if as some experts point out on average Gujarati women had secreted away much more than say the women of Uttar Pradesh, then their anger may also be more.",
      "userId": 3,
      "category": "Politics",
      "date": 1511613238682,
      "time": 1511613238682,
      "user": "user3",
      "id": 5
    },
    {
      "title": "Rahul Gandhi as Congress President: expect modern outlook on old-fashioned template",
      "content": "The Congress Working Committee (CWC) has finally set into motion the process that will elevate Rahul Gandhi as Congress President in the first week of December in all probability. But Rahul has his task cut out of revamping the party ahead of the 2019 parliamentary elections. While Rahul is expected to modernise the party’s outlook and approach, yet one ancient feature is likely to be retained in his style of politics – regional satraps.\n\nEver since Narendra Modi emerged on the national horizon, Congress has been facing setbacks in almost every state till now. Lack of clarity over who calls the shots between mother Sonia and heir-apparent Rahul led to mixed signals being sent amongst party workers. The tide only turned for them last year when they overthrew the SAD-BJP combine after a decade in Punjab. Even there the party was witnessing intense infighting between Partap Singh Bajwa and Captain Amarinder Singh just six months before the election. Finally Rahul intervened and handed over the reins of the state unit to Singh in November 2015.\n\nAfter Himachal and Gujarat, there are assembly elections scheduled in eight states before the 2019 general election. Chief Minister Siddaramaiah is likely to be in pole position for Congress in the Karnataka assembly elections. Rahul has already appointed trusted aides like KC Venugopal as general secretary, Madhu Yaskhi Goud and Manicka Tagore as secretaries to assist Siddaramaiah. Rahul seems to have arrived at a consensus on Jyotiraditya Scindia to lead the campaign in MP. This was evident when senior leaders like Kamal Nath and Digvijaya Singh indicated that Scindia should lead their campaign in the state.",
      "userId": 3,
      "category": "Politics",
      "date": 1511613394108,
      "time": 1511613394108,
      "user": "user3",
      "id": 6
    },
    {
      "title": "Life is Dust",
      "content": "Above each distant peak and skyward ship,\n\nFast-flowing streams of dust bombard the Earth;\n\nReleasing beads of life from Newton’s grip,\n\nTransporting them through space to bring new birth.\n\n \n\nDid everything we know just hitch a ride,\n\nOn streams of dust that sailed an unseen tide;\n\nThese particles just drifting in the sky,\n\nMay hide the echoes of a time gone by.\n\n\nFast-flowing streams of dust bombard the Earth.\nThis is a Heroic Rispetto, inspired by recent research that has found how life may be transported between worlds via streams of fast-moving space dust.\n\nPreviously it was believed that asteroids were the main mechanism through which life was transported between planets. However, new research has found that powerful flows of space dust (which can move at speeds of up to 70 km per hour) are constantly bombarding the Earth, creating gigantic flows in the atmosphere. This hypervelocity space dust can collide with particles high up in the Earth’s atmosphere (i.e. greater than 150 km above the surface), knocking them out of the reach of Earth’s gravity, before carrying them for large distances through outer space.\n\nCertain types of plants and bacteria can survive in outer space, and so it is possible that if they are present in the Earth’s atmosphere they might collide with fast-moving steams of space dust and be carried to another planet. Likewise, life on our planet might actually have originated from biological particles brought to Earth in streams of space dust. Further research into observing some of the particles that are currently “afloat” in Earth’s upper atmosphere may reveal more about the formation of life on our planet.",
      "userId": 4,
      "category": "Science",
      "date": 1511613713717,
      "time": 1511613713717,
      "user": "user4",
      "id": 7
    },
    {
      "title": "Big Data Creates Family Tree Of Constitutions",
      "content": "Inspired by the challenge to see how ideas are shared between nation’s through their founding documents, researchers at Dartmouth College have constructed a big data, evolutionary taxonomy of the world’s constitutions.\n\nThe analysis traces the textual ties that bind and has resulted in a mathematically-derived constitutional family tree. Visuals included with the study reveal the evolution of constitutions and constitutional ideas, and provide a window into how nations share political concepts.\n\n“If a new country arose tomorrow, it would not draft a constitution from scratch,” said Daniel Rockmore, the William H. Neukom 1964 Distinguished Professor of Computational Science at Dartmouth College, “it would look around to see what other countries have done, especially those that it feels a close relationship with.”\n\nFor decades, researchers have theorized that the evolution of national constitutions follow pathways similar to biological evolution. The Dartmouth analysis demonstrates that the historical development of constitutions follows the Yule Process – a model in evolutionary dynamics that describes birth process.\n\n“There’s a long literature – mainly qualitative in nature – around how constitutions evolve through words,” said Rockmore, “we show mathematically that the evolutionary approach that has been pondered since the 1970s is valid.”\n\nWhile other analyses have used textual clues to identify connections, the Dartmouth research used machine learning to organize constitutions by topics – words statistically linked in documents – and identified the flow of topics over time between constitutions.\n\n“Constitutions are complex cultural recombinants,” said Rockmore, “once you establish comparisons you can construct a tree and find close constitutional ancestors.”\n\nTo create the family tree, researchers focused on 591 national constitutions spanning 1789-2008. The U.S. Constitution is the earliest such document and is identified as the “Last Universal Common Ancestor Constitution” that serves as the root for the analysis. All other constitutions are measured through mathematical tools that reveal surprising relationships and unexpected information about what constitutions serve as the source of the most and least textual inspiration.\n\nBased on relationships revealed through the research, Thailand’s original 1932 founding document is cited as one of the history’s major constitutions having borrowed from 15 other constitutions and provided the textual basis for 33 others. The most prolific constitution is identified as Paraguay’s 1813 constitution, which thrives among Latin America’s abundance of constitutional texts.",
      "userId": 4,
      "category": "Science",
      "date": 1511613798635,
      "time": 1511613798635,
      "user": "user4",
      "id": 8
    },
    {
      "title": "Icebound Detector Reveals How Ghostly Neutrinos Are Stopped Cold",
      "content": "Famously, neutrinos, the nearly massless particles that are a fundamental component of the universe, can zip through a million miles of lead without skipping a beat.\n\nNow, in a critical measurement that may one day help predict new physics beyond the Standard Model of particle physics — the model that seeks to explain the fundamental forces of the universe — an international team of researchers with the IceCube Neutrino Observatory has shown how energized neutrinos can be stopped cold as they pass through the Earth.\n\nThe new measurement is reported today (Nov. 22, 2017) in the journal Nature by the IceCube Collaboration, an international consortium of scientists using the South Pole observatory to explore the neutrino and what it can tell us about matter and the nature of the universe.\nNeutrinos are among the most abundant particles in the cosmos. With almost no mass and no charge, they rarely interact with matter. Tens of trillions of neutrinos course through our bodies every second.\n\nEvery once in a while, however, high-energy neutrinos interact with protons or neutrons and are absorbed. Theory predicts that at high energies — higher than can be generated by any earthbound particle accelerator — neutrinos can be expected to interact with matter and be absorbed in the Earth instead of continuing to transit the cosmos.\n\n“We always say that no particle but the neutrino can go through the Earth,” explains Francis Halzen, a University of Wisconsin–Madison professor of physics and the IceCube principal investigator. “However, the neutrino does have a tiny probability to interact, and this probability increases with energy.”\n\nThat probability, Halzen adds, is what scientists call the neutrino cross section.",
      "userId": 4,
      "category": "Science",
      "date": 1511613882639,
      "time": 1511613882639,
      "user": "user4",
      "id": 9
    },
    {
      "title": "'Tom has gone and we'll go too': one last song for folk legend Tom Paley",
      "content": "An old man in an exceptional jumper is singing an old sea shanty in tribute to Tom Paley, who died last week aged 89. Everyone joins in with the chorus, hesitantly at first but harmonising strongly by the end: “Tom has gone and we’ll go, too. Tom’s gone to Hilo.”\n\n\nTom Paley obituary\n Read more\nPaley, a legendary figure on the folk scene who played with Lead Belly and Woody Guthrie, and influenced Bob Dylan and Jerry Garcia, was to be found awaiting his turn alongside the mixed company of regulars, veterans and first-timers at Sharp’s, one of London’s most venerable folk clubs, hosted at Cecil Sharp House, Camden (home to the English Folk Dance and Song Society).\n\nWith the sound of morris dancing and Lancashire clog practice echoing through the bar, Paley could often be found on a Tuesday night, pint in front of him, seemingly asleep, in his usual seat by the window. Then his turn to perform would come, and he would wake up, tell some ridiculous story, and reel off a tune on his fiddle.\n\nSo I headed back to Sharp’s a couple of days after his death, gazed at his empty seat, and listened to the tributes and songs from people who had known him.\n\nBorn in New York, Paley juggled folk singing with being a maths teacher. As a founding member of the New Lost City Ramblers, he was hugely influential in the American folk revival.\n\n Tom Paley performing with his son Ben.\nFacebook Twitter Pinterest\n Influential … Tom Paley performing with his son Ben. Photograph: Laurie Lewis\nHe lived Sweden for a while in the 60s – regulars at the club argued gently over how much Vietnam had to do with this – before moving to London, where he remained for half a century, forming and reforming bands, living in the same north London flat, and performing at pubs and clubs.\n\n“Sadly, his repertoire was much reduced,” says the woman on the door when I say I haven’t been down for a while. “By the end, it was just three or four songs, scraping on the fiddle.” Like many people here, she had known him since the 70s.\n\nThe beauty of Sharp’s is how welcoming it is. You’re asked if you’re planning to play or sing, and that’s it. There’s no vetting and the audience is polite and encouraging. Some people have been performing for years, others are newbies; accordion tunes and rambling tales go up against earnest singer-songwriters.\n\nOne guy turns up and explains that life has been hard for him since he was mugged and beaten up, leaving his hands shaking, “which at least helps with my tremolo”. His singing is heartfelt and true.\n\nMost of the other performers link their songs to Paley in some way, with New Lost City Ramblers covers by men from Vancouver or wearing Jerry Garcia T-shirts explaining how they played alongside him in the 80s. It is an evening of workers’ songs, of sailors’ songs, and the odd bit of scatological humour.\n\nAdvertisement\n\nIntroducing Irish rebel song The Wind That Shakes the Barley, one regular says she hadn’t sung since the 60s before meeting Paley in 1994, and he recommended she come to Sharp’s. “He said one of the nicest things that anyone’s said to me, which was, ‘I think you should be encouraged.’”\n\nBefitting a man of leftwing convictions, politics is never far from the surface of the night. An American Guthrie aficionado called Steve introduces Vigilante Man: “There’s a day when the sun’s core is going to run out of hydrogen and start fusing helium, and at that point the sun is going to expand and become a red giant and swallow the orbits of the four inner planets including the Earth. At that time, Donald Trump will blame Obama.”\n\nWe all raise a glass to Paley before the room is silenced by a song by a woman called Amanda, set to the words of Tam i’ the Kirk, a poem by Scottish writer Violet Jacob: “When a’body’s thochts is set on their ain salvation, / Mine’s set on you, mine’s set on you.”",
      "userId": 4,
      "category": "Music",
      "date": 1511613966459,
      "time": 1511613966459,
      "user": "user4",
      "id": 10
    },
    {
      "title": "‘Basmati Blues’ unsurprisingly does what Hollywood has always done – exoticise India’s ‘otherness’",
      "content": "In case you were wondering, the white man’s burden is still alive and well! Even though it is the 21st century, while India is launching US satellites into space and is the world’s fastest growing major economy, the country’s poverty and social ills continue be alluring for moviemakers in the West. \n\nFalling back on clichés is a remarkably effortless way to create content for mass entertainment. Every culture offers ready stereotypes, and there are a large number of people in other parts of the world who readily lap up the concocted and twisted narratives.\n\nIt is not surprising then, that mainstream entertainment around the world frequently leverages cultural caricatures. After all, thinking things through and reflecting on a complex reality is hard work, and is quite often not rewarded commensurately in the box office.\n\nMedia Watchdog\n‘Basmati Blues’ unsurprisingly does what Hollywood has always done – exoticise India’s ‘otherness’\nBy Amit Nangia Published: November 13, 2017\n9\nSHARES\n SHARE TWEET EMAIL\n\nBeyond the clichés around spicy food, wedding dances, and white woman coming to the rescue of a hapless village, some of the visuals in the trailer seem to be from another era. PHOTO: IMDB\nIn case you were wondering, the white man’s burden is still alive and well! Even though it is the 21st century, while India is launching US satellites into space and is the world’s fastest growing major economy, the country’s poverty and social ills continue be alluring for moviemakers in the West.\n\nFalling back on clichés is a remarkably effortless way to create content for mass entertainment. Every culture offers ready stereotypes, and there are a large number of people in other parts of the world who readily lap up the concocted and twisted narratives.\n\nIt is not surprising then, that mainstream entertainment around the world frequently leverages cultural caricatures. After all, thinking things through and reflecting on a complex reality is hard work, and is quite often not rewarded commensurately in the box office.\n\n \nProlific as Hollywood is, it needs a steady stream of diverse subjects to portray on celluloid, and every now and then, it zeroes in on India as the canvas on which to paint its offerings.\n\nHowever, the only stories it finds worth telling are usually the ones that showcase India through a lens of poverty, colonialism, exotic ‘otherness’, or spiritualism. Movies like Slumdog Millionaire, Indiana Jones and the Temple of Doom, Eat Love Pray, A Passage to India, or Million Dollar Arm have all played on such themes.\n\nThe latest movie to walk down this stereotypical path is Brie Larson’s new movie Basmati Blues – even before its release, it’s getting its fair share of flak.",
      "userId": 5,
      "category": "Others",
      "date": 1511614076595,
      "time": 1511614076595,
      "user": "user5",
      "id": 11
    },
    {
      "title": "The sequel challenge: Can ‘Tiger Zinda Hai’ fare better than or be as good as ‘Ek Tha Tiger’?",
      "content": "Creating movie franchises seems to be the norm nowadays, which means that if a movie does well, it will invariably lead to a sequel. It was thus unsurprising to hear about Tiger Zinda Hai, the sequel to the 2012 film, Ek Tha Tiger. \n\nSet to hit theatres in December 2017, the movie’s trailer was recently released and has been trending on Youtube since. Tiger Zinda Hai, directed by Ali Abbas Zafar and produced by Aditya Chopra, stars Salman Khan and Katrina Kaif in the lead roles, reprising their roles as Tiger and Zoya respectively.\n\nThe trailer begins in Iraq, showing us the inhuman regime under a terrorist organisation, while in the background a man narrates,\n“Jab say dunya bani hai, tab say har konay main sirf ek hi jang hui hai; sahi aur ghalat ki, roshni aur andheray ki.”\n\n(Since the creation of this world, only one war has been fought in every corner; between right and wrong, between light and darkness.)\n\nThe terrorist group, amidst committing other violent crimes, has also taken 25 nurses as hostage. Of course, the only hope of saving Iraq and freeing it from the terrorists is none other than Tiger himself.\n\nThe Videoscope\nThe sequel challenge: Can ‘Tiger Zinda Hai’ fare better than or be as good as ‘Ek Tha Tiger’?\nBy Muhammad Omar Iftikhar Published: November 10, 2017\nSHARE TWEET EMAIL\n\nCreating movie franchises seems to be the norm nowadays, which means that if a movie does well, it will invariably lead to a sequel. It was thus unsurprising to hear about Tiger Zinda Hai, the sequel to the 2012 film, Ek Tha Tiger.\n\nSet to hit theatres in December 2017, the movie’s trailer was recently released and has been trending on Youtube since. Tiger Zinda Hai, directed by Ali Abbas Zafar and produced by Aditya Chopra, stars Salman Khan and Katrina Kaif in the lead roles, reprising their roles as Tiger and Zoya respectively.\n\nThe trailer begins in Iraq, showing us the inhuman regime under a terrorist organisation, while in the background a man narrates,\n\n \n“Jab say dunya bani hai, tab say har konay main sirf ek hi jang hui hai; sahi aur ghalat ki, roshni aur andheray ki.”\n\n(Since the creation of this world, only one war has been fought in every corner; between right and wrong, between light and darkness.)\n\nThe terrorist group, amidst committing other violent crimes, has also taken 25 nurses as hostage. Of course, the only hope of saving Iraq and freeing it from the terrorists is none other than Tiger himself.\n\nPhoto: Screenshot\nEvery Bollywood movie Khan has starred in as of late has had a catchy one-liner, and this film presents its own worthy candidate with,\n\n“Shikaar to sub hi kartay hain, liken Tiger say behtar shikar koi nahin karta.”\n\n(Everyone hunts, but no one hunts better than Tiger)\n\nFrom what we are presented with, it seems as if the whole movie takes place in the harsh deserts of Iraq. Khan is seen performing some stunts as he fights the bad guys, but it was a pleasant surprise to see Zoya, the Pakistani spy played by Kaif, doing her own share of action scenes. It is no secret that Kaif is perhaps one of the fittest actresses in Bollywood, and seeing her performing such rigorous action sequences speaks volumes of her routine at the gym.",
      "userId": 5,
      "category": "Others",
      "date": 1511614198311,
      "time": 1511614198311,
      "user": "user5",
      "id": 12
    },
    {
      "title": "What should music TV look like in 2017?",
      "content": "‘There’s potential for the occasional pop-cultural grenade’\nIt’s testament to the nation’s fondness for Top of the Pops that not even Jimmy Savile and Dave Lee Travis have managed to entirely taint it – and it feels as if every year there’s a thinkpiece longing for a rebirth of the show (yes, including in the Guardian).\n\nThese nostalgists may be cheered by the news that the BBC is to air a new primetime music TV format this autumn, a six-part series featuring “live music performances, sketches and interviews”. Does this fill a much-lamented hole in the schedules, or will it be an irrelevance in 2017?\n\n\nBBC to launch Top of the Pops-style music show\n Read more\nMy colleagues have their two penn’orth below, but to my mind, TV can still be the perfect medium to bring radical music to a mass audience. Something about the passivity of TV-watching means you’re all the more jolted by startling activity: Manic Street Preachers in their balaclavas, for instance. The dissonant juxtapositions, too – like At the Drive-In’s impressionistic punk on Later… With Jools Holland segueing into Robbie Williams doing swing – can prove even more indelible than seeing a band in the flesh.\n\nThe explosion of catch-up TV, a more active kind of viewing, means that those passive moments are becoming less prevalent; and with truly mass-cultural pop stars as rare as they’ve ever been – and tastes as varied and particular as a tailored Spotify playlist – the reality is that this show will probably not chime with how we enjoy music today. Those “sketches and interviews” point to a Carpool Karaoke-style viral format being cooked up (the show’s producer, Fulwell 73, is responsible for that James Corden triumph). Producers will parcel up these and the performances into shareable chunks on YouTube, which is probably where they’ll mostly be watched – further reducing the likelihood of viewers stumbling across something unexpected.\n\nNevertheless, there’s still potential for the occasional pop-cultural grenade, where a performance shatters the conservatism of the format it’s performed in – and those moments will be worth waiting for.\nBen Beaumont-Thomas, music editor\n\n‘As anachronistic as releasing new material on 8-track cartridge’\nI grew up during what you could reasonably call the golden age of music television. My earliest memories are of Top of the Pops coming into its own in the glam era – literally the first thing I can remember seeing on TV is Roy Wood in full Wizzard drag – and the last programme I really invested in was BBC2’s groundbreaking late-80s alternative show, Snub TV.",
      "userId": 5,
      "category": "Music",
      "date": 1511614372607,
      "time": 1511614372607,
      "user": "user5",
      "id": 13
    },
    {
      "title": "The Brains Of Children With A Better Physical Fitness Possess A Greater Volume Of Gray Matter",
      "content": "Researchers from the University of Granada (UGR) have shown that physical fitness in children may affect their brain structure, which in turn may have an influence on their academic performance.\n\nMore specifically, the researchers have confirmed that physical fitness in children (especially aerobic capacity and motor ability) is associated with a greater volume of gray matter in several cortical and subcortical brain regions.\n\nIn particular, aerobic capacity has been associated with greater gray matter volume in frontal regions (premotor cortex and supplementary motor cortex), subcortical regions (hippocampus and caudate nucleus), temporal regions (inferior temporal gyrus and parahippocampal gyrus) and the calcarine cortex. All of those regions are important for the executive function as well as for learning, motor and visual processes.\n\nThis study has been published in the renowned Neuroimage journal and is part of the ActiveBrains project, which is a randomized clinical trial involving more than 100 overweight/obese children led by Francisco B. Ortega. Said project is being carried out mainly at the University of Granada’s Sport and Health Institute (IMUDS, from its abbreviation in Spanish) and the Mind, Brain and Behavior Research Center (CIMCYC).\n\n“Our work aims at answering questions such as whether the brain of children with better physical fitness is different from that of children with worse physical fitness and if this affects their academic performance”, Ortega explains.\n\n“The answer is short and forceful: yes, physical fitness in children is linked in a direct way to important brain structure differences, and such differences are reflected in the children’s academic performance”.\n\nBesides, the UGR research associates motor ability with a greater gray matter volume in two regions essential for language processing and reading: the inferior frontal gyrus and the superior temporal gyrus. However, muscular strength didn’t showed any independent association with gray matter volume in any brain region.\n\nAccording to Irene Esteban-Cornejo, postdoctoral researcher at the University of Granada and main author of this paper, gray matter volume in the cortical and subcortical regions influenced by physical fitness improves in turn the children’s academic performance.\n\nMoreover, “physical fitness is a factor that can be modified through physical exercise, and combining exercises that improve the aerobic capacity and the motor ability would be an effective approach to stimulate brain development and academic performance in overweight/obese children”.\n\nThis scientific paper means an important contribution to human knowledge which should be taken into account by educational and public health institutions.\n\n“We appeal both to politicians, who make educational laws that are increasingly more focused on instrumental subjects, and to teachers, who are the final link in the chain and teach Physical Education day after day. School is the only entity that gathers every children in a mandatory way for a period of at least 10 years, and as such, it’s the ideal context for applying such recommendations”, note the researchers.\n\nIn their own words, the authors of this study are “at the disposal of educational and public health institutions for talking about possible measures and putting them into action”.",
      "userId": 5,
      "category": "Science",
      "date": 1511614539977,
      "time": 1511614539977,
      "user": "user5",
      "id": 14
    },
    {
      "title": "MIT, Lamborghini Team Up On An Electric Car Of The Future",
      "content": "Members of the MIT community who passed through the Stata Center courtyard last week likely found it hard not to notice the Lamborghini parked there as if it were visiting from the future. The car’s name — Terzo Millenio — says it all. Terzo Millenio is an automobile prototype for the third millennium, and its unique ability to deliver high peak power and regenerate kinetic energy, all while ensuring the ability to release and harvest electric power, can be attributed to the work of MIT associate professor of chemistry Mircea Dinca.\n\nThe Terzo Millenio aims to be self-healing and electric — concepts that today seem about as far-fetched as the hovercrafts in “Back to the Future II”’s imagining of 2015. However, in reality, this technology is as attainable as it is visionary.\n\n“The new Lamborghini collaboration allows us to be ambitious and think outside the box in designing new materials that answer energy storage challenges for the demands of an electric sport vehicle,” says Dinca. “We look forward to teaming up with their engineers and work on this exciting project.”\n\nLamborghini is relying on MIT to make its cars of the future operate on electricity, while maintaining the aesthetic standards and high-powered mechanical elements that make operating these luxurious sports cars so thrilling for those who drive them. In October 2016, Automobili Lamborghini began a three-year partnership with MIT that will grant Lamborghini exclusive rights to emerging research related to battery storage and materials science.\n\nLamborghini’s mission for this partnership is to “rewrite the rules on super sports cars” by addressing energy storage systems, innovative materials, propulsion systems, visionary design, and “emotion.” By incorporating research from Dinca and John Hart, associate professor of mechanical engineering, who will investigate new carbon fiber and composite materials that could enable the complete body of the car to somehow be used as a battery system, the hope is that this ambitious, visually stunning prototype will become a reality.\n\n“We are thrilled to combine our expertise in advanced materials and manufacturing with the vision and support of Automobili Lamborghini, and to realize new concepts that will shape the future of transportation,” says Hart.\n\nThe concept of revolutionizing the Lamborghini of the future is an exciting one; not only will this collaboration undoubtedly lead to new technologies in the fields of the energy accumulation systems, materials science, and manufacturing, but MIT students will have the opportunity to perform research at Automobili Lamborghini. The sustained contact forged between MIT and Lamborghini carries the potential for groundbreaking revelations.",
      "userId": 5,
      "category": "Science",
      "date": 1511614631828,
      "time": 1511614631828,
      "user": "user5",
      "id": 15
    },
    {
      "title": "India’s challenge is to maintain intensity and build momentum for South Africa tour",
      "content": "When it comes to Test cricket, Australia versus England — called the Ashes — is the stand out contest. Since the turn of this millennium, there have been 45 Ashes Tests and another series kicks off Down Under next week.\nIf there is one rivalry in world cricket that could potentially match the Ashes, it is India versus Pakistan. Yet, for one or the other reason, the two countries have not been able to engage bilaterally in recent years. Thus, to seek out a rivalry, the BCCI turned to another regional opponent — Sri Lanka. Little else can explain why the two teams have played 21 Tests since the turn of this millennium, nine of them since 2010, and that number will swell to 12 before the end of 2017.\nThere is no merit to be found in scheduling six Tests in six months between the same opponents, apart from commercialisation. The BCCI wanted to etch out a proper home season, so they advanced this tour to its current status from March 2018 (original FTP window).\nSri Lanka, in return, get to host a T20 multi-nation tournament in that slot, with the Men in Blue assuring participation of course.\n\nTo say that this amounts to an overdose would be an understatement, whether from the players’ or fans’ point of view. At least one group has a voice in this matter. “This analysis can only be done by fans who watch the game over a period of time. For us, the game is very different from those watching it. For us, there is no room for complacency. We are at our absolute top intensity at all times,” said Indian skipper Virat Kohli, on the eve of the first Test in Kolkata.\nHis words deflect attention off those who may not turn on their television sets before the first week of January, when the South African tour comes about. For the Indian team though, the pressing concern is finding equilibrium between different quality of opponents and a sharp contrast in conditions on offer.\n“We want to develop our game for different conditions. If you want to be the top-ranked side in the world for a long period of time, you have to win everywhere. Right now, we have gone through a good phase where a lot of cricket has been played at home. If we had played all this cricket away (overseas), we would have maintained the same intensity and the same mind set,” said Kohli, looking forward to taking on the Lankans, whilst also keeping an eye out for the Proteas.\nIn a way, it reveals the inner machinations of the Indian dressing room. Any and every team borrows heavily from the traits of its leader, and it’s true for the current Indian set-up as well.\nKohli is immensely invested in his own process, whether in the nets, in the middle, fielding, making bowling changes, or simply even shouting off his trademark passionate cries. His persona is individualistic, not deriving from external factors like opponents and conditions. And, over the last two years, this Indian team has been moulded in much the same way. They want to excel, in every outing, in each session, and win all the matches they play.\nIt reflects in the pride with which they take the field as the No. 1-ranked Test side in the world. “To remain number one, every series, every match, is important. To do that, we focus on our strengths rather than thinking about their combination or their strategies. We may have won in Sri Lanka earlier, but this series is completely different,” said vice-captain Ajinkya Rahane, giving voice to the thoughtprocess instilled in the team by Kohli.\nThe question here is obvious. This group of players, time and again, has talked about winning overseas, as much as they have spoken about playing every game on its merit. In terms of scale then, on the one hand you have a lowly opposition (no disrespect to Sri Lanka, but there is a gulf in quality between the two sides at present) and on the other hand, South Africa anticipate India’s arrival.\nThere is no question of complacency. Yet, how do you balance expectation from the present with anticipation of the future, specifically when you can taste them both at the same time? The answer perhaps lies in consistency, as Kohli puts it, in ‘playing good cricket as a unit’ and leaving the results to take care of themselves.\nAs such, when India thrashed Sri Lanka by 3-0 in July-August, the common refrain was about that same measure of performance. How did the runs scored and wickets taken stand in merit in a one-sided contest, for there were no parameters of judgment? This time around, weather permitting in Kolkata, India have a standard of performance to measure themselves against — their own.\nAt the very least, Kohli and company would want to match the same intensity, winning in a trance without breaking sweat. At the most, they would want to get definitive momentum going, signalling intent to those watching in South Africa.",
      "userId": 6,
      "category": "Sports",
      "date": 1511615482733,
      "time": 1511615482733,
      "user": "user6",
      "id": 16
    },
    {
      "title": "How far they'll go: Moana shows the power of Polynesian celestial navigation",
      "content": "One of the greatest feats of human migration in history was the colonisation of the vast Pacific Ocean by Polynesian peoples. They achieved it thanks to their sophisticated knowledge of positional astronomy and celestial navigation.\n\nThe Disney film Moana has drawn attention to these accomplishments and helped inform a new generation about the complexity of Indigenous astronomy.\n\nPolynesia forms a triangle across the Pacific, with Hawaii to the north, Rapa Nui (Easter Island) to the southeast, and Aotearoa (New Zealand) to the southwest, with Tahiti in the centre. But Polynesian voyaging extends beyond this triangle; there is strong evidence they reached the coast of South America and sub-Antarctic islands.\n\n The Polynesian triangle, with Melanesia and Micronesia\nWikipedia user Kahuroa\nTHE POLYNESIAN TRIANGLE, WITH MELANESIA AND MICRONESIA\nMoana touches on Polynesian voyaging, showing the eponymous main character using traditional celestial techniques to navigate across the sea.\n\nDuring production, Disney created the Oceanic Story Trust – a board of experts, including Polynesian locals and elders – to advise on cultural accuracy. The film accomplished this reasonably well, especially in respect to celestial navigation, despite the producers facing criticism for cultural appropriation and commodification.\n\nNavigating by hand\n\nTo navigate the wide expanse of the Pacific, voyagers need to map the stars to determine their position from our perspective here on Earth. Navigator and Polynesian Voyaging Society president Nainoa Thompson explains:\n\nIf you can identify the stars as they rise and set, and if you have memorised where they rise and set, you can find your direction.\nSince 1976, the famous Hokule'a voyages have demonstrated how Polynesians used traditional sea-craft and navigational techniques to cross the expanse of the Pacific, from Japan to Canada.\n\n The Hōkūle‘a\nPolynesian Voyaging Society / ‘Ōiwi TV\nTHE HŌKŪLE‘A\nIn 1976, the Hōkūle‘a sailed from Hawaii to Tahiti using traditional navigational methods.\nSo what are some of these navigational techniques?\n\nTo calculate their position on Earth, voyagers memorised star maps and used the angle of stars above the horizon to determine latitude. For example, the top and bottom stars of the Southern Cross are separated by six degrees. When the distance between those stars is equal to the bottom star’s altitude above the horizon, your northerly latitude is 21º: that of Honolulu.\n\nWhen the bright stars Sirius and Pollux set at exactly the same time, your latitude is 18º South: the latitude of Tahiti.\n\nVoyagers measure the angles between stars and the horizon using their hands. The width of your pinkie finger at arm’s length is roughly one degree, or double the angular diameter of the Sun or Moon.\n\nHold your hand with the palm facing outward and thumb fully extended, touching the horizon. Each part of your hand is used to measure a particular altitude.\n\n Navigating using the stars\nJournal of the Polynesian Society / B. R. Finney et al. (1986)\nNAVIGATING USING THE STARS\nThe hand method used by navigator Nainoa Thompson to find the altitude of the Polaris.\nIn Hawai'i, the “North Star”, Polaris, is Hokupa'a, meaning “fixed star”. It lies close to the north celestial pole. The altitude of Hokupa'a indicates your northerly latitude.\n\nIn the film, we see Moana Waialiki using this technique to measure the altitude of a group of stars. Look closely and you can see that she’s measuring the stars in Orion’s Belt. The position of Moana’s hand indicates the star above her index finger has an altitude of 21º. Given that the movie takes place about 2,000 years ago near Samoa, the position of Orion indicates they are travelling exactly due East.\n\n Measuring with Orion's belt\nWalt Disney Studios Motion Pictures\nMEASURING WITH ORION'S BELT\nMoana finds her way using Orion’s belt stars.\nLater in the film, we see Moana navigating by following Maui’s fish hook. In the various Polynesian traditions, the hook was used to pull islands from the sea. It is represented by the constellation Scorpius, which rises at dusk in mid-May. This indicates southeasterly travel.\n\n Maui's hook\nStellarium\nMAUI'S HOOK\nLooking at Scorpius—Maui's Hook—in the same orientation as shown in the film.\nHowever, the positions of the stars are not fixed in time. Over the 3,500 years that Polynesians have been exploring the Pacific, the stars have gradually shifted due to precession of the equinoxes.\n\nFrom the latitude of Samoa, the Southern Cross has lowered from 60º altitude in 1500 BCE to 41º today. Those navigating by the stars must gradually adjust their measurements as the positions of stars slowly shift over time.\n\nIn his book Hawaiki Rising, Sam Low tells how navigators would develop new techniques.",
      "userId": 1,
      "category": "Others",
      "date": 1511616145582,
      "time": 1511616145582,
      "user": "User1",
      "id": 17
    }
  ]
}